{
	"fn": {
		"about": {
			"image": {
				"altText": "Fortnite",
				"src": "https://cdn2.unrealengine.com/fnbr-35-00-c6ms1-egs-launcher-keyart-fn-blade-1200x1600-1200x1600-8facee535882.jpg",
				"_type": "Diesel Image"
			},
			"developerAttribution": "Epic Games",
			"_type": "Diesel Product About",
			"publisherAttribution": "Epic Games",
			"description": "[![Mobile](https://cdn2.unrealengine.com/en-egs-ios-announceimage-pdp-fn-3840x632-3840x632-6a494c5260ec.jpg)](http://store.epicgames.com/mobile)\n\nExplore large, destructible environments where no two games are ever the same. Team up with friends by sprinting, climbing and smashing your way to earn your Victory Royale, whether you choose to build up in Fortnite Battle Royale or go no-builds in Fortnite Zero Build.\n\nDiscover even more ways to play across thousands of creator-made game genres: adventure, roleplay, survival and more. Or, band together with up to three friends to fend off hordes of monsters in Save the World.\n\n# Chapter 6 Star Wars\n\n![KeyArt Image](https://cdn2.unrealengine.com/fnbr-35-00-c6ms1-sonylauncher-coverart-3840x2160-logo-3840x2160-9256494ead4c.jpg)\n\nThe Death Star looms with its superlaser array fixed on the Battle Royale map! Heroes from across Star Wars eras are preparing to strike back against Emperor Palpatine's assault from the shadows. Ready your blaster and strap in starfighter, we're defending the Island against an Imperial invasion in Fortnite: GALACTIC BATTLE!\n\n# Play Your Way!\n\nSprint, climb, and smash your way to a Victory Royale whether you choose to build up in Fortnite Battle Royale or go no-builds in Fortnite Zero Build.\n\n![FNBR keyart with logo](https://cdn2.unrealengine.com/fnbr-35-00-c6ms1-egs-launcher-keyart-carousel-pdp-2560x1440-nologo-2560x1440-1be10295fc04.jpg)\n\n# Take the offensive in Fortnite Zero Build No Build Battle Royale\n\nIntroducing a new, tactical take on Fortnite Battle Royale with the launch of Fortnite Zero Build. Show off your sharp shooting, sharp thinking, and sharp sense of space as you take on the Battle full-tilt in Fortnite Zero Build. \n\nWithout building, all players have the recharging Overshield as their first line of defense in Zero Build. Slide downhill to avoid enemy fire or use mantling to get the high ground on opponents. Don’t forget to sprint between cover on your way to a Victory Royale!\n\n![FNBR screenshot](https://cdn2.unrealengine.com/01-screen-3840x2160-c2a370384608.png)\n\n# Zero Build is a pure test of weapon, item, and traversal skill - no building required.\n\nZero Build is a pure test of weapon, item, and traversal ability. Zero Build can be found in the Discover page as Solo, Duos, Trios, and Squads playlists. (Access the Discover page by clicking on the “CHANGE” button above “PLAY!” in the Lobby.)\n\nFortnite Zero Build shares XP progression and Quests with Fortnite Battle Royale, meaning you can earn XP towards your Battle Pass in either Fortnite Zero Build or Fortnite Battle Royale. Take on a new challenge and level up along the way!\n\n![BuildBattleCreate Image](https://cdn2.unrealengine.com/cltm-evergreen-1920x1080-b267506a89c5.jpg)\n\n# Battle. Build. Create. \n\nPlay Fortnite your way. \n\nBe the last player standing in Battle Royale, Zero Build and Reload, explore and survive in LEGO Fortnite, blast to the finish with Rocket Racing or headline a concert with Fortnite Festival. Play thousands of free creator made islands with friends including deathruns, tycoons, racing, zombie survival and more! Join the creator community and build your own island with Unreal Editor for Fortnite (UEFN) or Fortnite Creative tools.\n\nEach Fortnite island has an individual age rating so you can find the one that's right for you and your friends. Find it all in Fortnite!\n\n![FNCrew Image](https://cdn2.unrealengine.com/en-fneco-crewupdate-egs-pdp-carousel-2560x1440-2560x1440-221e010a39ef.jpg)\n\n# Fortnite Crew\n\nThe Ultimate Fortnite Offer\n\nThe best way to maximize your Fortnite experience. Joining Fortnite Crew gets members everything below for only $11.99 each month.\n\n• Any Pass, Any Time! Subscribe to Fortnite Crew to claim premium rewards from each Pass (Battle Pass, Music Pass, LEGO® Pass, and the Fortnite OG Pass on Dec 6)\n\n• 1,000 V-Bucks Each Month - Fortnite Crew members will receive 1,000 V-Bucks every month. Spend it on your favorite Item Shop content!\n\n• Get A Monthly Crew Pack! - Get an exclusive Fortnite Crew Pack, an always-new Outfit Bundle that only Fortnite Crew members can get.\n\nRecurring fee charged monthly until cancelled. Cancel anytime.\n\nIf you’d like to learn more about Fortnite Crew, you can find all details and FAQs at <https://www.epicgames.com/fortnite/fortnite-crew-subscription>",
			"shortDescription": "Create, play, and battle with friends for free in Fortnite. Be the last player standing in Battle Royale and Zero Build, experience a concert or live event, or discover over a million creator made games, including racing, parkour, zombie survival, and more.  Each Fortnite island has an individual age rating so you can find the one that's right for you and your friends. Find it all in Fortnite ... Drop In.",
			"title": "",
			"developerLogo": {
				"src": "https://cdn2.unrealengine.com/Diesel%2Flogo%2FLogo_EpicGames_Black-1360x1360-f15ee5845c95eacd424199bdf326047631b4bc69.png",
				"_type": "Diesel Image"
			}
		},
		"reqs": [
			{
				"_type": "Diesel System Detail Item",
				"title": "OS",
				"minimum": "Windows 10 64-bit version 1703",
				"recommended": "Windows 10/11 64-bit"
			},
			{
				"_type": "Diesel System Detail Item",
				"title": "CPU",
				"minimum": "Core i3-3225 3.3 GHz",
				"recommended": "Core i5-7300U 3.5 GHz, AMD Ryzen 3 3300U, or equivalent"
			},
			{
				"_type": "Diesel System Detail Item",
				"title": "Memory",
				"minimum": "8 GB RAM",
				"recommended": "16 GB RAM or higher"
			},
			{
				"_type": "Diesel System Detail Item",
				"title": "GPU",
				"minimum": "Intel HD 4000 on PC; AMD Radeon Vega 8",
				"recommended": "Nvidia GTX 960, AMD R9 280, or equivalent DX11 GPU"
			},
			{
				"_type": "Diesel System Detail Item",
				"title": "VRAM ",
				"minimum": "",
				"recommended": "8 GB VRAM or higher"
			},
			{
				"_type": "Diesel System Detail Item",
				"title": "Additional",
				"recommended": "NVMe Solid State Drive"
			}
		],
		"releaseDate": "2017-07-25T04:00:00",
		"storeUrl": "https://www.epicgames.com/store/product/fortnite"
	},
	"__timestamp": {
		"fn": "Tue May 13 2025 11:36:10 GMT-0400 (Eastern Daylight Time)"
	}
}